<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"2938c1235f15aec03f15fc5b683862858200a8c6d7a7e23b63980fa1c274f8bf","plan_job_ref":"Job Terraform Plan #535 at https://github.com/cal-itp/data-infra/actions/runs/17867989277","plan_out_hash":"64123c43273e6f52602129db483a418d1b7aab7af65febda90762bab4d7c7e28","plan_hash":"013b8140c9fda878acf71ce381ccbed31621d4955478d530b09984161eb01106","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/gcs/us__
<details>
<summary>Plan: 1 to add, 8 to change, 1 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_storage_bucket.tfer--calitp-state-highway-network-stops must be replaced
-/+ resource "google_storage_bucket" "tfer--calitp-state-highway-network-stops" {
!~      effective_labels            = {
+           "goog-terraform-provisioned" = "true"
        }
-       enable_object_retention     = false -> null
!~      id                          = "**********************************" -> (known after apply)
-       labels                      = {} -> null
!~      location                    = "US" -> "US-WEST2" # forces replacement
        name                        = "calitp-state-highway-network-stops"
!~      project_number              = 1005246706141 -> (known after apply)
!~      rpo                         = "DEFAULT" -> (known after apply)
!~      self_link                   = "https://www.googleapis.com/storage/v1/b/calitp-state-highway-network-stops" -> (known after apply)
!~      terraform_labels            = {
+           "goog-terraform-provisioned" = "true"
        }
!~      time_created                = "2024-10-01T17:58:00.763Z" -> (known after apply)
!~      updated                     = "2024-10-01T17:58:00.763Z" -> (known after apply)
!~      url                         = "gs://calitp-state-highway-network-stops" -> (known after apply)
#        (7 unchanged attributes hidden)

-       hierarchical_namespace {
-           enabled = false -> null
        }

!~      soft_delete_policy (known after apply)
-       soft_delete_policy {
-           effective_time             = "2024-10-01T17:58:00.763Z" -> null
-           retention_duration_seconds = 604800 -> null
        }

-       timeouts {}

!~      versioning (known after apply)

!~      website (known after apply)
    }

  # google_storage_bucket.tfer--rt-parsed-deprecated will be updated in-place
!~  resource "google_storage_bucket" "tfer--rt-parsed-deprecated" {
        id                          = "rt-parsed-deprecated"
        name                        = "rt-parsed-deprecated"
!~      terraform_labels            = {
+           "deprecated" = (known after apply)
        }
#        (16 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # google_storage_bucket_iam_binding.tfer--calitp-gtfs-rt-validation will be updated in-place
!~  resource "google_storage_bucket_iam_binding" "tfer--calitp-gtfs-rt-validation" {
        id      = "calitp-gtfs-rt-validation"
!~      members = [
-           "serviceAccount:project-1005246706141@storage-transfer-service.iam.gserviceaccount.com",
#            (1 unchanged element hidden)
        ]
#        (3 unchanged attributes hidden)
    }

  # google_storage_bucket_iam_binding.tfer--rt-parsed-deprecated will be updated in-place
!~  resource "google_storage_bucket_iam_binding" "tfer--rt-parsed-deprecated" {
        id      = "rt-parsed-deprecated"
!~      members = [
-           "serviceAccount:project-1005246706141@storage-transfer-service.iam.gserviceaccount.com",
#            (1 unchanged element hidden)
        ]
#        (3 unchanged attributes hidden)
    }

  # google_storage_bucket_iam_policy.tfer--calitp-gtfs-rt-parsed will be updated in-place
!~  resource "google_storage_bucket_iam_policy" "tfer--calitp-gtfs-rt-parsed" {
        id          = "calitp-gtfs-rt-parsed"
!~      policy_data = jsonencode(
!~          {
!~              bindings = [
                    {
                        members = [
                            "projectEditor:cal-itp-data-infra",
                            "projectOwner:cal-itp-data-infra",
                        ]
                        role    = "roles/storage.legacyBucketOwner"
                    },
!~                  {
!~                      members = [
                            "projectViewer:cal-itp-data-infra",
-                           "serviceAccount:project-1005246706141@storage-transfer-service.iam.gserviceaccount.com",
                        ]
#                        (1 unchanged attribute hidden)
                    },
                    {
                        members = [
                            "projectEditor:cal-itp-data-infra",
                            "projectOwner:cal-itp-data-infra",
                        ]
                        role    = "roles/storage.legacyObjectOwner"
                    },
                    {
                        members = [
                            "projectViewer:cal-itp-data-infra",
                        ]
                        role    = "roles/storage.legacyObjectReader"
                    },
-                   {
-                       members = [
-                           "serviceAccount:project-1005246706141@storage-transfer-service.iam.gserviceaccount.com",
                        ]
-                       role    = "roles/storage.objectAdmin"
                    },
-                   {
-                       members = [
-                           "serviceAccount:project-1005246706141@storage-transfer-service.iam.gserviceaccount.com",
                        ]
-                       role    = "roles/storage.objectViewer"
                    },
                ]
            }
        )
#        (2 unchanged attributes hidden)
    }

  # google_storage_bucket_iam_policy.tfer--calitp-gtfs-rt-raw-v2 will be updated in-place
!~  resource "google_storage_bucket_iam_policy" "tfer--calitp-gtfs-rt-raw-v2" {
        id          = "calitp-gtfs-rt-raw-v2"
!~      policy_data = jsonencode(
!~          {
!~              bindings = [
                    {
                        members = [
                            "projectEditor:cal-itp-data-infra",
                            "projectOwner:cal-itp-data-infra",
                        ]
                        role    = "roles/storage.legacyBucketOwner"
                    },
!~                  {
!~                      members = [
                            "projectViewer:cal-itp-data-infra",
-                           "serviceAccount:project-1005246706141@storage-transfer-service.iam.gserviceaccount.com",
                        ]
#                        (1 unchanged attribute hidden)
                    },
                    {
                        members = [
                            "projectEditor:cal-itp-data-infra",
                            "projectOwner:cal-itp-data-infra",
                        ]
                        role    = "roles/storage.legacyObjectOwner"
                    },
#                    (2 unchanged elements hidden)
                    {
                        members = [
                            "serviceAccount:gtfs-rt-archiver-v3@cal-itp-data-infra.iam.gserviceaccount.com",
                        ]
                        role    = "roles/storage.objectCreator"
                    },
!~                  {
!~                      members = [
                            "serviceAccount:gtfs-rt-archiver-v3@cal-itp-data-infra.iam.gserviceaccount.com",
-                           "serviceAccount:project-1005246706141@storage-transfer-service.iam.gserviceaccount.com",
                        ]
#                        (1 unchanged attribute hidden)
                    },
                ]
            }
        )
#        (2 unchanged attributes hidden)
    }

  # google_storage_bucket_iam_policy.tfer--calitp-gtfs-rt-validation will be updated in-place
!~  resource "google_storage_bucket_iam_policy" "tfer--calitp-gtfs-rt-validation" {
        id          = "calitp-gtfs-rt-validation"
!~      policy_data = jsonencode(
!~          {
!~              bindings = [
                    {
                        members = [
                            "projectEditor:cal-itp-data-infra",
                            "projectOwner:cal-itp-data-infra",
                        ]
                        role    = "roles/storage.legacyBucketOwner"
                    },
!~                  {
!~                      members = [
                            "projectViewer:cal-itp-data-infra",
-                           "serviceAccount:project-1005246706141@storage-transfer-service.iam.gserviceaccount.com",
                        ]
#                        (1 unchanged attribute hidden)
                    },
                    {
                        members = [
                            "projectEditor:cal-itp-data-infra",
                            "projectOwner:cal-itp-data-infra",
                        ]
                        role    = "roles/storage.legacyObjectOwner"
                    },
                    {
                        members = [
                            "projectViewer:cal-itp-data-infra",
                        ]
                        role    = "roles/storage.legacyObjectReader"
                    },
-                   {
-                       members = [
-                           "serviceAccount:project-1005246706141@storage-transfer-service.iam.gserviceaccount.com",
                        ]
-                       role    = "roles/storage.objectAdmin"
                    },
                ]
            }
        )
#        (2 unchanged attributes hidden)
    }

  # google_storage_bucket_iam_policy.tfer--calitp-gtfs-schedule-raw-v2 will be updated in-place
!~  resource "google_storage_bucket_iam_policy" "tfer--calitp-gtfs-schedule-raw-v2" {
        id          = "calitp-gtfs-schedule-raw-v2"
!~      policy_data = jsonencode(
!~          {
!~              bindings = [
#                    (4 unchanged elements hidden)
                    {
                        members = [
                            "serviceAccount:project-1005246706141@storage-transfer-service.iam.gserviceaccount.com",
                        ]
                        role    = "roles/storage.objectAdmin"
                    },
-                   {
-                       members = [
-                           "serviceAccount:project-1005246706141@storage-transfer-service.iam.gserviceaccount.com",
                        ]
-                       role    = "roles/storage.objectViewer"
                    },
                ]
            }
        )
#        (2 unchanged attributes hidden)
    }

  # google_storage_bucket_iam_policy.tfer--rt-parsed-deprecated will be updated in-place
!~  resource "google_storage_bucket_iam_policy" "tfer--rt-parsed-deprecated" {
        id          = "rt-parsed-deprecated"
!~      policy_data = jsonencode(
!~          {
!~              bindings = [
                    {
                        members = [
                            "projectEditor:cal-itp-data-infra",
                            "projectOwner:cal-itp-data-infra",
                        ]
                        role    = "roles/storage.legacyBucketOwner"
                    },
!~                  {
!~                      members = [
                            "projectViewer:cal-itp-data-infra",
-                           "serviceAccount:project-1005246706141@storage-transfer-service.iam.gserviceaccount.com",
                        ]
#                        (1 unchanged attribute hidden)
                    },
                    {
                        members = [
                            "projectEditor:cal-itp-data-infra",
                            "projectOwner:cal-itp-data-infra",
                        ]
                        role    = "roles/storage.legacyObjectOwner"
                    },
                    {
                        members = [
                            "projectViewer:cal-itp-data-infra",
                        ]
                        role    = "roles/storage.legacyObjectReader"
                    },
-                   {
-                       members = [
-                           "serviceAccount:project-1005246706141@storage-transfer-service.iam.gserviceaccount.com",
                        ]
-                       role    = "roles/storage.objectAdmin"
                    },
                ]
            }
        )
#        (2 unchanged attributes hidden)
    }

Plan: 1 to add, 8 to change, 1 to destroy.

Changes to Outputs:
!~  google_storage_bucket_tfer--calitp-state-highway-network-stops_self_link                                   = "https://www.googleapis.com/storage/v1/b/calitp-state-highway-network-stops" -> (known after apply)
```
</details>

:memo: Plan generated in [Terraform Plan #535](https://github.com/cal-itp/data-infra/actions/runs/17867989277)